Duet3D/Duet3Expansion/src/atmel/SAMS70_DFP/2.3.88/sams70b/include/component/isi.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_IMR_OFFSET                      (0x34)                                        /**<  (ISI_IMR) ISI Interrupt Mask Register  Offset */

#define ISI_IMR_DIS_DONE_Pos                1                                              /**< (ISI_IMR) Module Disable Operation Completed Position */
#define ISI_IMR_DIS_DONE_Msk                (_U_(0x1) << ISI_IMR_DIS_DONE_Pos)             /**< (ISI_IMR) Module Disable Operation Completed Mask */
#define ISI_IMR_DIS_DONE                    ISI_IMR_DIS_DONE_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_DIS_DONE_Msk instead */
#define ISI_IMR_SRST_Pos                    2                                              /**< (ISI_IMR) Software Reset Completed Position */
#define ISI_IMR_SRST_Msk                    (_U_(0x1) << ISI_IMR_SRST_Pos)                 /**< (ISI_IMR) Software Reset Completed Mask */
#define ISI_IMR_SRST                        ISI_IMR_SRST_Msk                               /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_SRST_Msk instead */
#define ISI_IMR_VSYNC_Pos                   10                                             /**< (ISI_IMR) Vertical Synchronization Position */
#define ISI_IMR_VSYNC_Msk                   (_U_(0x1) << ISI_IMR_VSYNC_Pos)                /**< (ISI_IMR) Vertical Synchronization Mask */
#define ISI_IMR_VSYNC                       ISI_IMR_VSYNC_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_VSYNC_Msk instead */
#define ISI_IMR_PXFR_DONE_Pos               16                                             /**< (ISI_IMR) Preview DMA Transfer Completed Position */
#define ISI_IMR_PXFR_DONE_Msk               (_U_(0x1) << ISI_IMR_PXFR_DONE_Pos)            /**< (ISI_IMR) Preview DMA Transfer Completed Mask */
#define ISI_IMR_PXFR_DONE                   ISI_IMR_PXFR_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_PXFR_DONE_Msk instead */
#define ISI_IMR_CXFR_DONE_Pos               17                                             /**< (ISI_IMR) Codec DMA Transfer Completed Position */
#define ISI_IMR_CXFR_DONE_Msk               (_U_(0x1) << ISI_IMR_CXFR_DONE_Pos)            /**< (ISI_IMR) Codec DMA Transfer Completed Mask */
#define ISI_IMR_CXFR_DONE                   ISI_IMR_CXFR_DONE_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_CXFR_DONE_Msk instead */
#define ISI_IMR_P_OVR_Pos                   24                                             /**< (ISI_IMR) Preview FIFO Overflow Position */
#define ISI_IMR_P_OVR_Msk                   (_U_(0x1) << ISI_IMR_P_OVR_Pos)                /**< (ISI_IMR) Preview FIFO Overflow Mask */
#define ISI_IMR_P_OVR                       ISI_IMR_P_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_P_OVR_Msk instead */
#define ISI_IMR_C_OVR_Pos                   25                                             /**< (ISI_IMR) Codec FIFO Overflow Position */
#define ISI_IMR_C_OVR_Msk                   (_U_(0x1) << ISI_IMR_C_OVR_Pos)                /**< (ISI_IMR) Codec FIFO Overflow Mask */
#define ISI_IMR_C_OVR                       ISI_IMR_C_OVR_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_C_OVR_Msk instead */
#define ISI_IMR_CRC_ERR_Pos                 26                                             /**< (ISI_IMR) CRC Synchronization Error Position */
#define ISI_IMR_CRC_ERR_Msk                 (_U_(0x1) << ISI_IMR_CRC_ERR_Pos)              /**< (ISI_IMR) CRC Synchronization Error Mask */
#define ISI_IMR_CRC_ERR                     ISI_IMR_CRC_ERR_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_CRC_ERR_Msk instead */
#define ISI_IMR_FR_OVR_Pos                  27                                             /**< (ISI_IMR) Frame Rate Overrun Position */
#define ISI_IMR_FR_OVR_Msk                  (_U_(0x1) << ISI_IMR_FR_OVR_Pos)               /**< (ISI_IMR) Frame Rate Overrun Mask */
#define ISI_IMR_FR_OVR                      ISI_IMR_FR_OVR_Msk                             /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_IMR_FR_OVR_Msk instead */
#define ISI_IMR_MASK                        _U_(0xF030406)                                 /**< \deprecated (ISI_IMR) Register MASK  (Use ISI_IMR_Msk instead)  */
#define ISI_IMR_Msk                         _U_(0xF030406)                                 /**< (ISI_IMR) Register Mask  */


/* -------- ISI_DMA_CHER : (ISI Offset: 0x38) (/W 32) DMA Channel Enable Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef union { 
  struct {
    uint32_t P_CH_EN:1;                 /**< bit:      0  Preview Channel Enable                   */
    uint32_t C_CH_EN:1;                 /**< bit:      1  Codec Channel Enable                     */
    uint32_t :30;                       /**< bit:  2..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} ISI_DMA_CHER_Type;
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define ISI_DMA_CHER_OFFSET                 (0x38)                                        /**<  (ISI_DMA_CHER) DMA Channel Enable Register  Offset */

#define ISI_DMA_CHER_P_CH_EN_Pos            0                                              /**< (ISI_DMA_CHER) Preview Channel Enable Position */
#define ISI_DMA_CHER_P_CH_EN_Msk            (_U_(0x1) << ISI_DMA_CHER_P_CH_EN_Pos)         /**< (ISI_DMA_CHER) Preview Channel Enable Mask */
#define ISI_DMA_CHER_P_CH_EN                ISI_DMA_CHER_P_CH_EN_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_DMA_CHER_P_CH_EN_Msk instead */
#define ISI_DMA_CHER_C_CH_EN_Pos            1                                              /**< (ISI_DMA_CHER) Codec Channel Enable Position */
#define ISI_DMA_CHER_C_CH_EN_Msk            (_U_(0x1) << ISI_DMA_CHER_C_CH_EN_Pos)         /**< (ISI_DMA_CHER) Codec Channel Enable Mask */
#define ISI_DMA_CHER_C_CH_EN                ISI_DMA_CHER_C_CH_EN_Msk                       /**< \deprecated Old style mask definition for 1 bit bitfield. Use ISI_DMA_CHER_C_CH_EN_Msk instead */
#define ISI_DMA_CHER_MASK                   _U_(0x03)                                      /**< \deprecated (ISI_DMA_CHER) Register MASK  (Use ISI_DMA_CHER_Msk instead)  */
#define ISI_DMA_CHER_Msk                    _U_(0x03)                                      /**< (ISI_DMA_CHER) Register Mask  */


